comp-sci/theorem-provers/mizar/group-theory.org
#+TITLE: Group Theory in Mizar
#+AUTHOR: Alex Nelson
#+EMAIL: pqnelson@gmail.com
#+DATE: <2022-02-17T08:57:24-08:00>
#+LANGUAGE: en
#+OPTIONS: H:5
#+HTML_DOCTYPE: html5
#+INCLUDE: ../../../org-macros.org
#+HTML_LINK_UP: ./index.html
#+HTML_LINK_HOME: ../../../index.html
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="../../../css/stylesheet.css" />
# Created Thursday February 17, 2022 at  8:57AM

* Overview
:PROPERTIES:
:CUSTOM_ID: h-2ee11eae-9c96-4924-b78c-f735667f49fd
:END:

This is just a "map" or "analytical table of contents", of where things
are defined in the "group theory wing" of the Mizar library.

Most of the useful articles seem to be ~GROUP_1~ through ~GROUP_10~, and
then it splinters into specialist subjects.

* Group Theory
:PROPERTIES:
:CUSTOM_ID: h-9f5cf940-9a00-4b52-886d-f414fb02838d
:END:

- Nilpotent groups are discussed in  [[http://mizar.org/version/current/html/grnilp_1.html][~grnilp_1.miz~]]
  - ~the_normal_subgroups_of G~ is defined in ~GRNILP_1:Def1~ as we would
    expect it
  - The upper central series is implicit in the definition of
    ~nilpotent~ in ~Def2~
- Solvable groups discussed in  [[http://mizar.org/version/current/html/grsolv_1.html][~grsolv_1.miz~]]
  - ~solvable~ as an attribute is defined as having a subnormal series
    such that ~F.i ./. F.(i+1)~ is Abelian
- Some Properties of $p$-Groups and Commutative $p$-Groups  [[http://mizar.org/version/current/html/groupp_1.html][~groupp_1.miz~]]
- Cayley's theorem proven in [[http://mizar.org/version/current/html/cayley.html][~cayley.miz~]]
  - Symmetric group on a set $X$ is defined on line 145 of [[http://mizar.org/version/current/html/cayley.html][~cayley.miz~]]
- Product groups are defined in [[http://mizar.org/version/current/html/group_7.html][~group_7~]], but it's difficult to work with
  - Normal subgroups of product groups discussed further in [[http://mizar.org/version/current/html/group_12.html][~group_12~]]
- A lot of properties proved in [[http://mizar.org/version/current/html/group_8.html][~group_8.miz~]]
- Jordon-Holder theorem in [[http://mizar.org/version/current/html/group_9.html][~group_9.miz~]]
  - The ~composition_series~ is defined (~GROUP_9:Def28~) as an
    attribute for a finite sequence of stable subgroups of $G$
    - The ~CompositionSeries of G~ mode is defined as
      ~composition_series FinSequence of the_stable_subgroups_of G~
  - More generally, I expect a subgroup series to be a sequence of
    subgroups; and if the series starts at $G$, then I should use
    ~(Omega).G~ instead
    - ~sequence~ is defined as a mode in ~nat_1~, for any set ~X~ we
      have ~mode sequence of X is Function of NAT,X~
      
