docs/comp-sci/theorem-provers/mizar/group-theory.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Group Theory in Mizar</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Group Theory in Mizar</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-2ee11eae-9c96-4924-b78c-f735667f49fd">1. Overview</a></li>
<li><a href="#h-9f5cf940-9a00-4b52-886d-f414fb02838d">2. Group Theory</a>
<ul>
<li><a href="#h-9a4b3e2e-01b9-42a2-a500-bd576e9efca7">2.1. Definitions</a></li>
<li><a href="#h-71dc116b-6bab-4e06-9d8a-ab7a6a7dd9fc">2.2. Product Groups</a></li>
<li><a href="#h-2a6b701b-cdd4-4958-9a40-b98df09ff271">2.3. Specific Groups</a></li>
<li><a href="#h-e33b09d4-26e4-44e8-b68b-31bf539a87b4">2.4. Representation Theory</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-h-2ee11eae-9c96-4924-b78c-f735667f49fd" class="outline-2">
<h2 id="h-2ee11eae-9c96-4924-b78c-f735667f49fd"><span class="section-number-2">1.</span> Overview</h2>
<div class="outline-text-2" id="text-h-2ee11eae-9c96-4924-b78c-f735667f49fd">
<p>
This is just a "map" or "analytical table of contents", of where things
are defined in the "group theory wing" of the Mizar library.
</p>

<p>
Most of the useful articles seem to be <code>GROUP_1</code> through <code>GROUP_10</code>, and
then it splinters into specialist subjects.
</p>
</div>
</div>

<div id="outline-container-h-9f5cf940-9a00-4b52-886d-f414fb02838d" class="outline-2">
<h2 id="h-9f5cf940-9a00-4b52-886d-f414fb02838d"><span class="section-number-2">2.</span> Group Theory</h2>
<div class="outline-text-2" id="text-h-9f5cf940-9a00-4b52-886d-f414fb02838d">
<ul class="org-ul">
<li>Nilpotent groups are discussed in  <a href="http://mizar.org/version/current/html/grnilp_1.html"><code>grnilp_1.miz</code></a>
<ul class="org-ul">
<li><code>the_normal_subgroups_of G</code> is defined in <code>GRNILP_1:Def1</code> as we would
expect it</li>
<li>The upper central series is implicit in the definition of
<code>nilpotent</code> in <code>Def2</code></li>
</ul></li>
<li>Solvable groups discussed in  <a href="http://mizar.org/version/current/html/grsolv_1.html"><code>grsolv_1.miz</code></a>
<ul class="org-ul">
<li><code>solvable</code> as an attribute is defined as having a subnormal series
such that <code>F.i ./. F.(i+1)</code> is Abelian</li>
</ul></li>
<li>Some Properties of $p$-Groups and Commutative $p$-Groups  <a href="http://mizar.org/version/current/html/groupp_1.html"><code>groupp_1.miz</code></a></li>
<li>Cayley's theorem proven in <a href="http://mizar.org/version/current/html/cayley.html"><code>cayley.miz</code></a>
<ul class="org-ul">
<li>Symmetric group on a set \(X\) is defined on line 145 of <a href="http://mizar.org/version/current/html/cayley.html"><code>cayley.miz</code></a></li>
</ul></li>
<li>Product groups are defined in <a href="http://mizar.org/version/current/html/group_7.html"><code>group_7</code></a>, but it's difficult to work with
<ul class="org-ul">
<li>Normal subgroups of product groups discussed further in <a href="http://mizar.org/version/current/html/group_12.html"><code>group_12</code></a></li>
</ul></li>
<li>A lot of properties proved in <a href="http://mizar.org/version/current/html/group_8.html"><code>group_8.miz</code></a></li>
<li>Jordon-Holder theorem in <a href="http://mizar.org/version/current/html/group_9.html"><code>group_9.miz</code></a>
<ul class="org-ul">
<li>The <code>composition_series</code> is defined (<code>GROUP_9:Def28</code>) as an
attribute for a finite sequence of stable subgroups of \(G\)
<ul class="org-ul">
<li>The <code>CompositionSeries of G</code> mode is defined as
<code>composition_series FinSequence of the_stable_subgroups_of G</code></li>
</ul></li>
<li>More generally, I expect a subgroup series to be a sequence of
subgroups; and if the series starts at \(G\), then I should use
<code>(Omega).G</code> instead
<ul class="org-ul">
<li><code>sequence</code> is defined as a mode in <code>nat_1</code>, for any set <code>X</code> we
have <code>mode sequence of X is Function of NAT,X</code></li>
</ul></li>
</ul></li>
</ul>
</div>
