docs/comp-sci/theorem-provers/mizar/group-theory.html

<div id="outline-container-h-9a4b3e2e-01b9-42a2-a500-bd576e9efca7" class="outline-3">
<h3 id="h-9a4b3e2e-01b9-42a2-a500-bd576e9efca7"><span class="section-number-3">2.1.</span> Definitions</h3>
<div class="outline-text-3" id="text-h-9a4b3e2e-01b9-42a2-a500-bd576e9efca7">
<ul class="org-ul">
<li>Inverse operator is denoted by double quotes, so <code>x"</code> denotes \(x^{-1}\)
as defined in <a href="http://mizar.org/version/current/html/group_1.html"><code>group_1.miz</code></a> line 210 (<code>func h" -&gt; Element of G means h * it = 1_G &amp; it * h = 1_G;</code>)
<ul class="org-ul">
<li><p>
This is also extended to, for a group \(G\), subsets \(A\subset G\)
we'd have <code>A"</code> be the collection of <code>g"</code> for <code>g in A</code>, i.e.,
\(A^{-1}=\{g^{-1}|g\in A\}\); see line 57 of <a href="http://mizar.org/version/current/html/group_2.html"><code>group_2.miz</code></a>
</p>
<pre class="example" id="org69f51bd">
let G be Group;
let A be Subset of G;
func A " -&gt; Subset of G equals :: GROUP_2:def 1
{ (g ") where g is Element of G : g in A } ;
</pre></li>
</ul></li>
<li>the mode definition <code>Subgroup of G</code>, line 853 of  <a href="http://mizar.org/version/current/html/group_2.html"><code>group_2.miz</code></a>; for
some reason, if \(H\lt G\), then <code>carr(H)</code> is defined as the subset of the
underlying set of \(G\) equal to the set underlying \(H\)</li>
<li>If \(H_{1}\lt G\) and \(H_{2}\lt G\), then \(H_{1}\cap H_{2}\) is defined on line
1563 of <a href="http://mizar.org/version/current/html/group_2.html"><code>group_2.miz</code></a></li>
<li><p>
The trivial subgroup of \(G\) is denoted <code>(1).G</code>, defined on line 1258
of <a href="http://mizar.org/version/current/html/group_2.html"><code>group_2.miz</code></a> as
</p>
<pre class="example" id="org15cd7ce">
  func (1).G -&gt; strict Subgroup of G means
  :Def7:
  the carrier of it = {1_G};
</pre>
<ul class="org-ul">
<li><b>NOTE:</b> the adjective "trivial" isn't actually defined until <a href="http://mizar.org/version/current/html/group_6.html"><code>GROUP_6</code></a></li>
<li><p>
"strict" is a weird meta-term (c.f., <a href="http://mizar.uwb.edu.pl/forum/archive/0701/msg00008.html">discussion</a>),
</p>
<blockquote>
<p>
"strict" doesn't have its own definition as it is a special (in a way "meta" attribute) - it means that a term which has a structure type &lt;Theta&gt; has exactly the same selectors (fields) as introduced in the definition of the type &lt;Theta&gt;, so in your case only the selectors of a doubleLoopStr - any extension to that would break the "strictness". So you may think of a vector space as of a group, but it's not a "strict" group.
</p>
</blockquote></li>
<li>"strict" for subgroup is on line 1011 of <a href="http://mizar.org/version/current/html/group_2.html"><code>group_2.miz</code></a>; it's a
registration of a cluster. I believe it refers to being a proper
subgroup.</li>

<li><code>(Omega).G</code> (line of <a href="http://mizar.org/version/current/html/group_2.html"><code>group_2.miz</code></a>) seems to be the other trivial subgroup of \(G\), i.e., \(G\) itself
<ul class="org-ul">
<li>This seems to be following notation introduced in  <a href="http://mizar.org/version/current/html/rlsub_1.html"><code>rlsub_1.miz</code></a>,
line 764; a comment before it notes this notation is used for
improper subspaces</li>
</ul></li>
<li>Left cosets are defined on line 2448 of <a href="http://mizar.org/version/current/html/group_2.html"><code>group_2.miz</code></a> (right cosets</li>
</ul>
<p>
are defined on line 2468)
</p></li>
<li>The index of a subgroup \(H\lt G\) is defined as the cardinality of left
cosets of \(H\)  on line 2789 of <a href="http://mizar.org/version/current/html/group_2.html"><code>group_2.miz</code></a></li>

<li>Conjugation of \(a\) by \(b\) (both elements of \(G\)) is denoted
<code>a |^ b</code>, defined on lines 299&#x2013;300 of <a href="http://mizar.org/version/current/html/group_3.html"><code>group_3.miz</code></a>
<ul class="org-ul">
<li>This is extended to subsets \(A\) and \(B\) of \(G\), <code>A |^ B</code> is the
collection of conjugating elements of \(A\) by elements of \(B\)
<code>func A |^ B -&gt; Subset of G equals {g |^ h : g in A &amp; h in B};</code></li>
<li>We also have <code>g |^ A</code> and <code>A |^ g</code> for conjugating an element by
members of a subset, and conjugating a subset by an element</li>
</ul></li>
<li>Conjugate subgroup to \(H\lt G\) is defined lines 897 <i>et seq</i> of
<a href="http://mizar.org/version/current/html/group_3.html"><code>group_3.miz</code></a> as <code>H |^ a</code> (conjugate subgroup of a finite group is
itself finite, as registration on line 1068 notes)</li>
<li><code>a,b are_conjugated</code> defined on line 1270 of <a href="http://mizar.org/version/current/html/group_3.html"><code>group_3.miz</code></a> if there is a \(g\in G\) such
that <code>a = b |^ g</code> (and two subsets are conjugated, defined on line
1523; for two subgroups on line 1738)</li>
<li>Conjugacy class of \(a\in G\) is defined as the subset of \(G\) given by
<code>a |^ carr (Omega).G</code> around line 1367 of <a href="http://mizar.org/version/current/html/group_3.html"><code>group_3.miz</code></a> (and the
conjugacy class of a subset of \(G\) is defined around line 1615; the
conjugacy class for a subgroup defined on line 1810)
<ul class="org-ul">
<li><code>conjugate_Classes G</code> defined line 1131 of <a href="http://mizar.org/version/current/html/weddwit.html"><code>weddwit.miz</code></a></li>
</ul></li>
<li>A normal subgroup is defined on line 1956 of <a href="http://mizar.org/version/current/html/group_3.html"><code>group_3.miz</code></a> as
<code>for a holds IT |^ a = the multMagma of IT</code> and then it is registered
as <code>strict normal</code></li>
<li>The normalizer for a subset \(A\subset G\) is defined on line 2419 of <a href="http://mizar.org/version/current/html/group_3.html"><code>group_3.miz</code></a>
as <code>func Normalizer A -&gt; strict Subgroup of G means :Def14: the carrier of it = {h : A |^ h = A};</code>
(normalizer of a subgroup is defined on line 2638)</li>
<li>If \(A\) is a subset of a group \(G\), the <code>gr A</code> seems to be the smallest
subgroup containing \(A\)</li>
<li><p>
Frattini subgroup is tricky. Relevant code starts around 1371 of  <a href="http://mizar.org/version/current/html/group_4.html"><code>group_4.miz</code></a>
</p>
<pre class="example" id="orgb789895">
::$N Frattini subgroup
  func Phi(G) -&gt; strict Subgroup of G means
  :Def7:
  the carrier of it = meet{A
where A is Subset of G : ex H being strict Subgroup of G st A = the carrier of
H &amp; H is maximal} if ex H being strict Subgroup of G st H is maximal otherwise
  it = the multMagma of G;
</pre></li>
<li>The notation \(H_{1}\wedge H_{2}\) for the smallest group containing
both \(H_{1}\) and \(H_{2}\) (defined line 1877 <a href="http://mizar.org/version/current/html/group_4.html"><code>group_4.miz</code></a>) it is given
the name <code>SubJoin</code> on line 2636; dually, the submeet is defined on
line 2680</li>
<li>Lattice of subgroups defined line 2795 of <a href="http://mizar.org/version/current/html/group_4.html"><code>group_4.miz</code></a></li>
<li>Commutator of group elements line 331 of <a href="http://mizar.org/version/current/html/group_5.html"><code>group_5.miz</code></a>; <code>commutators(A,B)</code> for
subsets of \(G\) on line 964; <code>commutators(H1,H2)</code> of subgroups defined on line 1091;
and <code>commutators G</code> is defined as the commutator of the underlying set
of \(G\) with itself</li>
<li>A triple \([a,b,c]=[[a,b],c]\) line 662 of <a href="http://mizar.org/version/current/html/group_5.html"><code>group_5.miz</code></a></li>
<li>the smallest group containing <code>commutators(A,B)</code> is defined as <code>[.A,B.]</code>
on line 1262; and similarly for subgroups <code>[.H1,H2.]</code> defined on line 1297</li>
<li>the derived group is define on line 1578 of <a href="http://mizar.org/version/current/html/group_5.html"><code>group_5.miz</code></a></li>
<li>the center of \(G\) is defined on line 1775 of <a href="http://mizar.org/version/current/html/group_5.html"><code>group_5.miz</code></a>
as a strict subgroup of \(G\) consisting of <code>{a : for b holds a * b = b * a};</code>
<ul class="org-ul">
<li>The Centralizer of an element \(a\in G\) is defined line 739 of
<a href="http://mizar.org/version/current/html/weddwit.html"><code>weddwit.miz</code></a></li>
<li>The center for a skew-field \(R\) is defined on line 1508 of <a href="http://mizar.org/version/current/html/weddwit.html"><code>weddwit.miz</code>,</a>
and the centralizer for an element of \(R\) is defined on line 1978</li>
</ul></li>
<li>The quotient group \(G/N\) is denoted as <code>G./.N</code> in Mizar, and it is
defined on line 505 of <a href="http://mizar.org/version/current/html/group_6.html"><code>group_6</code></a>; the canonical mapping of \(N\to G/N\)
is defined on line 1084 as the <code>nat_hom</code></li>
<li>Group morphisms are defined in <a href="http://mizar.org/version/current/html/group_6.html"><code>group_6</code></a> as multiplicative functions
between two groups</li>
<li>Two groups \(G\) and \(H\) <code>are_isomorphic</code> if there exists a bijective
group morphism between them ( <a href="http://mizar.org/version/current/html/group_6.html"><code>group_6</code></a>);</li>
<li>The kernel of a morphism of groups is defined in  <a href="http://mizar.org/version/current/html/group_6.html"><code>group_6</code></a>;</li>
<li>The isomorphism theorems for groups is also defined in <a href="http://mizar.org/version/current/html/group_6.html"><code>group_6</code></a>;
<ul class="org-ul">
<li>There seems to be a small hack to describe the subgroup \(N\leq H\leq G\)
corresponding to \(H/N\) as <code>H./.(H,N)`*`</code></li>
<li><code>GROUP_6:Th29</code> says if <code>M</code> and <code>N</code> are normal subgroups of <code>G</code> such
that <code>M</code> is a subgroup of <code>N</code>, then <code>N./.(N,M)`*`</code> is a normal
Subgroup of <code>G./.M</code></li>
</ul></li>
<li>a group \(G\) is "simple" if <code>IT is not trivial</code> and there is no
nontrivial normal subgroup \(H\triangleleft G\) (i.e., \(H\neq 1\) and
\(H\neq G\)) line 998 of <a href="http://mizar.org/version/current/html/group_9.html#V5"><code>group_9.miz</code></a></li>
<li>The chunk of text dealing with composition series begins on line 6701
of <a href="http://mizar.org/version/current/html/group_9.html"><code>group_9.miz</code></a> (the <code>composition_series</code> is defined on line 6708)</li>
<li>The Jordan-Holder attribute for composition series of \(G\)
(line 6821 of <a href="http://mizar.org/version/current/html/group_9.html"><code>group_9.miz</code></a>)</li>
<li>Equivalence of composition series is defined (line 6835 of <a href="http://mizar.org/version/current/html/group_9.html"><code>group_9.miz</code></a>)</li>
<li>Schreier refinement theorem begins (line 10378 of <a href="http://mizar.org/version/current/html/group_9.html"><code>group_9.miz</code></a>);
<code>the_schreier_series_of</code> is defined 10383</li>
<li><code>p-subgroup</code> defined on line 1786 of <a href="http://mizar.org/version/current/html/group_10.html"><code>group_10.miz</code></a></li>
<li><code>is_Sylow_p-subgroup_of_prime</code> defined line 2196 of <a href="http://mizar.org/version/current/html/group_10.html"><code>group_10.miz</code></a></li>
<li><code>the_sylow_p-subgroups_of_prime(p,G)</code> defined line 3109 of <a href="http://mizar.org/version/current/html/group_10.html"><code>group_10.miz</code></a></li>
</ul>
</div>
</div>
