comp-sci/theorem-provers/mizar/group-theory.org
** Product Groups
:PROPERTIES:
:CUSTOM_ID: h-71dc116b-6bab-4e06-9d8a-ab7a6a7dd9fc
:END:

- Product groups are discussed in [[http://mizar.org/version/current/html/group_7.html][~group_7~]], [[http://mizar.org/version/current/html/group_12.html][~group_12~]],
  [[http://mizar.org/version/current/html/group_19.html][~group_19~]], and briefly in a few other articles.
- For sets, the Cartesian product of a family of sets is scattered in
  several articles.
  - The Cartesian product of a family of sets is defined in
    [[http://mizar.org/version/current/html/card_3.html#K4][~CARD_3:def 2~]]
  - A family of sets indexed by $I$ is called a ~ManySortedSet of I~
    in Mizar, and defined in [[http://mizar.org/version/current/html/pboole.html#NM1][~pboole.miz~]]
- The notion of a "family of groups" is defined using the following
  strategy in [[http://mizar.org/version/current/html/group_7.html][~group_7~]]:
  - A binary relation is defined as ~multMagma-yielding~ if every object
    in its range is a ~multMagma~ (~GROUP_7:def 1~)
  - A family of magmas indexed by $I$ is defined as a ~multMagma-Family of I~
  - We define a product of a family of magmas, which produces a [strict] magma.
  - We then define a number of attributes for a family of magmas:
    associative, commutative, Group-like; we cluster functorial
    registrations indicating the product of an associative family of
    magmas is an associative magma, etc.
  - This will give us, from the power of Mizar adjectives, the product
    of an associative group-like family of magmas /is/ a group.
- If $\mathcal{F}$ is a family of groups indexed by $I$, the isomorphism
  of $\mathcal{F}_{i}$ with "its obvious subgroup" in $\prod\mathcal{F}$
  is defined in [[http://mizar.org/version/current/html/group_12.html][~group_12~]] (the isomorphism is ~(1ProdHom (F, i))~ and
  the subgroup is ~ProjGroup (F,i)~).
- In [[http://mizar.org/version/current/html/group_19.html][~group_19~]], a family of groups indexed by $I$ is defined as a
  group-like associative family of magmas.
- The basic design here is
  - if $\mathcal{F}$ is a family of groups indexed by $I$, then
    $\mathcal{F}_{i}$ is a group and the Mizar notation for this would
    be ~F.i~
  - if $g\in\prod\mathcal{F}$ is an element of the product group, then
    $g_{i}\in\mathcal{F}_{i}$ is written in Mizar as ~g.i~ (so ~g~ is a
    function with ~dom g = I~).


** Specific Groups
:PROPERTIES:
:CUSTOM_ID: h-2a6b701b-cdd4-4958-9a40-b98df09ff271
:END:

- The permutation group is defined in [[http://mizar.uwb.edu.pl/version/current/html/matrix_1.html#K10][~MATRIX_1~]] as ~Group_of_Perm n~
  - The attribute [[http://mizar.uwb.edu.pl/version/current/html/matrix_1.html#V6][~even~]] is defined there
  - This is the Symmetric group on $n$ symbols --- i.e., $S_{n}$ = ~Group_of_Perm n~
  - The symmetric group on an arbitrary set $X$ is defined in ~CAYLEY~ as
    [[http://mizar.uwb.edu.pl/version/current/html/cayley.html#K2][~SymGroup X~]] --- i.e., $\mathrm{Sym}(X)$ = ~SymGroup X~
  - If you want to prove properties about permutation groups, you should
    work with ~Group_of_Perm n~.
- The group $\mathbb{Z}$ is defined in [[http://mizar.uwb.edu.pl/version/current/html/gr_cy_1.html#K2][~GR_CY_1~]] as ~INT.Group~
- The finite cyclic group $\mathbb{Z}/n\mathbb{Z}$ is defined as
  ~INT.Group(n)~ in [[http://mizar.uwb.edu.pl/version/current/html/gr_cy_1.html#K4][~GR_CY_1~]]
  
** Representation Theory
:PROPERTIES:
:CUSTOM_ID: h-e33b09d4-26e4-44e8-b68b-31bf539a87b4
:END:

It seems that the notion of a group action and group representation
are...well, kind of muddled in Mizar.

- [[http://mizar.org/version/current/html/funct_2.html#NM5][~Action of O,E~]] defines how a set ~O~ acts on ~E~, it's an
  abbreviation for the type ~Function of O,(Funcs (E,E))~.
  - For ~O~ being a group, this is really "almost" a
    representation. We'd need to prove it's a homomorphism, in the sense
    that for any ~g,h in O~ we would have ~a.(g*h) = (a.g) * (a.h)~.
  - This is not a group action, which would be a type
    ~Function of [:O,E:],E~ such that for any ~g,h being Element of O~
    and for any ~e being Element of E~ we would have
    ~it.(g,it.(h,e))=it.(g*h,e)~ as desired.
  - This definition is from Bourbaki; see {{{book-title(Algebra)}}}
    chapter I \sect 3.1, \sect5.1 /et seq/.
- If we wanted to define a ~Representation~ of a group, probably we
  would need to:
  1. Define an adjective ~Representation-like~ on a
     ~Function of G,(Funcs (E,E))~ as something like
     ~for g,h being Element of G holds IT.(g * h) = (IT.g) * (IT.h)~
  2. Register ~Representation-like for Function of G,(Funcs (E,E))~
  3. Define a type ~Representation of G means ex E st it is Representation-like for Function of G,(Funcs (E,E))~
- An alternative plan would be:
  1. Define a structure ~RepresentationStr~ consisting of a set ~E~ and
     a mapping ~Function of G,(Funcs (E,E))~
  2. Define an adjective ~Representation-like~ for ~RepresentationStr~
     which ensures the ~Function of G,(Funcs (E,E))~ is multiplicative
  3. Define a ~mode Representation is Representation-like RepresentationStr~.

