docs/comp-sci/theorem-provers/mizar/group-theory.html

<div id="outline-container-h-71dc116b-6bab-4e06-9d8a-ab7a6a7dd9fc" class="outline-3">
<h3 id="h-71dc116b-6bab-4e06-9d8a-ab7a6a7dd9fc"><span class="section-number-3">2.2.</span> Product Groups</h3>
<div class="outline-text-3" id="text-h-71dc116b-6bab-4e06-9d8a-ab7a6a7dd9fc">
<ul class="org-ul">
<li>Product groups are discussed in <a href="http://mizar.org/version/current/html/group_7.html"><code>group_7</code></a>, <a href="http://mizar.org/version/current/html/group_12.html"><code>group_12</code></a>,
<a href="http://mizar.org/version/current/html/group_19.html"><code>group_19</code></a>, and briefly in a few other articles.</li>
<li>For sets, the Cartesian product of a family of sets is scattered in
several articles.
<ul class="org-ul">
<li>The Cartesian product of a family of sets is defined in
<a href="http://mizar.org/version/current/html/card_3.html#K4"><code>CARD_3:def 2</code></a></li>
<li>A family of sets indexed by \(I\) is called a <code>ManySortedSet of I</code>
in Mizar, and defined in <a href="http://mizar.org/version/current/html/pboole.html#NM1"><code>pboole.miz</code></a></li>
</ul></li>
<li>The notion of a "family of groups" is defined using the following
strategy in <a href="http://mizar.org/version/current/html/group_7.html"><code>group_7</code></a>:
<ul class="org-ul">
<li>A binary relation is defined as <code>multMagma-yielding</code> if every object
in its range is a <code>multMagma</code> (<code>GROUP_7:def 1</code>)</li>
<li>A family of magmas indexed by \(I\) is defined as a <code>multMagma-Family of I</code></li>
<li>We define a product of a family of magmas, which produces a [strict] magma.</li>
<li>We then define a number of attributes for a family of magmas:
associative, commutative, Group-like; we cluster functorial
registrations indicating the product of an associative family of
magmas is an associative magma, etc.</li>
<li>This will give us, from the power of Mizar adjectives, the product
of an associative group-like family of magmas <i>is</i> a group.</li>
</ul></li>
<li>If \(\mathcal{F}\) is a family of groups indexed by \(I\), the isomorphism
of \(\mathcal{F}_{i}\) with "its obvious subgroup" in \(\prod\mathcal{F}\)
is defined in <a href="http://mizar.org/version/current/html/group_12.html"><code>group_12</code></a> (the isomorphism is <code>(1ProdHom (F, i))</code> and
the subgroup is <code>ProjGroup (F,i)</code>).</li>
<li>In <a href="http://mizar.org/version/current/html/group_19.html"><code>group_19</code></a>, a family of groups indexed by \(I\) is defined as a
group-like associative family of magmas.</li>
<li>The basic design here is
<ul class="org-ul">
<li>if \(\mathcal{F}\) is a family of groups indexed by \(I\), then
\(\mathcal{F}_{i}\) is a group and the Mizar notation for this would
be <code>F.i</code></li>
<li>if \(g\in\prod\mathcal{F}\) is an element of the product group, then
\(g_{i}\in\mathcal{F}_{i}\) is written in Mizar as <code>g.i</code> (so <code>g</code> is a
function with <code>dom g = I</code>).</li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-h-2a6b701b-cdd4-4958-9a40-b98df09ff271" class="outline-3">
<h3 id="h-2a6b701b-cdd4-4958-9a40-b98df09ff271"><span class="section-number-3">2.3.</span> Specific Groups</h3>
<div class="outline-text-3" id="text-h-2a6b701b-cdd4-4958-9a40-b98df09ff271">
<ul class="org-ul">
<li>The permutation group is defined in <a href="http://mizar.uwb.edu.pl/version/current/html/matrix_1.html#K10"><code>MATRIX_1</code></a> as <code>Group_of_Perm n</code>
<ul class="org-ul">
<li>The attribute <a href="http://mizar.uwb.edu.pl/version/current/html/matrix_1.html#V6"><code>even</code></a> is defined there</li>
<li>This is the Symmetric group on \(n\) symbols &#x2014; i.e., \(S_{n}\) = <code>Group_of_Perm n</code></li>
<li>The symmetric group on an arbitrary set \(X\) is defined in <code>CAYLEY</code> as
<a href="http://mizar.uwb.edu.pl/version/current/html/cayley.html#K2"><code>SymGroup X</code></a> &#x2014; i.e., \(\mathrm{Sym}(X)\) = <code>SymGroup X</code></li>
<li>If you want to prove properties about permutation groups, you should
work with <code>Group_of_Perm n</code>.</li>
</ul></li>
<li>The group \(\mathbb{Z}\) is defined in <a href="http://mizar.uwb.edu.pl/version/current/html/gr_cy_1.html#K2"><code>GR_CY_1</code></a> as <code>INT.Group</code></li>
<li>The finite cyclic group \(\mathbb{Z}/n\mathbb{Z}\) is defined as
<code>INT.Group(n)</code> in <a href="http://mizar.uwb.edu.pl/version/current/html/gr_cy_1.html#K4"><code>GR_CY_1</code></a></li>
</ul>
</div>
</div>

<div id="outline-container-h-e33b09d4-26e4-44e8-b68b-31bf539a87b4" class="outline-3">
<h3 id="h-e33b09d4-26e4-44e8-b68b-31bf539a87b4"><span class="section-number-3">2.4.</span> Representation Theory</h3>
<div class="outline-text-3" id="text-h-e33b09d4-26e4-44e8-b68b-31bf539a87b4">
<p>
It seems that the notion of a group action and group representation
are&#x2026;well, kind of muddled in Mizar.
</p>

<ul class="org-ul">
<li><a href="http://mizar.org/version/current/html/funct_2.html#NM5"><code>Action of O,E</code></a> defines how a set <code>O</code> acts on <code>E</code>, it's an
abbreviation for the type <code>Function of O,(Funcs (E,E))</code>.
<ul class="org-ul">
<li>For <code>O</code> being a group, this is really "almost" a
representation. We'd need to prove it's a homomorphism, in the sense
that for any <code>g,h in O</code> we would have <code>a.(g*h) = (a.g) * (a.h)</code>.</li>
<li>This is not a group action, which would be a type
<code>Function of [:O,E:],E</code> such that for any <code>g,h being Element of O</code>
and for any <code>e being Element of E</code> we would have
<code>it.(g,it.(h,e))=it.(g*h,e)</code> as desired.</li>
<li>This definition is from Bourbaki; see <cite class="book-title">Algebra</cite>
chapter I &sect; 3.1, &sect;5.1 <i>et seq</i>.</li>
</ul></li>
<li>If we wanted to define a <code>Representation</code> of a group, probably we
would need to:
<ol class="org-ol">
<li>Define an adjective <code>Representation-like</code> on a
<code>Function of G,(Funcs (E,E))</code> as something like
<code>for g,h being Element of G holds IT.(g * h) = (IT.g) * (IT.h)</code></li>
<li>Register <code>Representation-like for Function of G,(Funcs (E,E))</code></li>
<li>Define a type <code>Representation of G means ex E st it is Representation-like for Function of G,(Funcs (E,E))</code></li>
</ol></li>
<li>An alternative plan would be:
<ol class="org-ol">
<li>Define a structure <code>RepresentationStr</code> consisting of a set <code>E</code> and
a mapping <code>Function of G,(Funcs (E,E))</code></li>
<li>Define an adjective <code>Representation-like</code> for <code>RepresentationStr</code>
which ensures the <code>Function of G,(Funcs (E,E))</code> is multiplicative</li>
<li>Define a <code>mode Representation is Representation-like RepresentationStr</code>.</li>
</ol></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2023-01-20 Fri 11:30.</p>
</div>
</body>
</html>